<?php // Вариант №11
    echo('Вариант №11' . '<br>'); 
    $a = rand(-20, 20); 
    $c = rand(-20, 20);
    $d = rand(-20, 20);
    echo ('Дано:' . '<br>' . 'a = ' . $a. '<br>' . 'c = '. $c . '<br>' . 'd = ' . $d . '<br>');
    $result = ((abs($c-($d/2)))*($b-7))/(2*$a-1);
    echo ('Результат:' . '<br>' . $result. '<br>');
?>
<?php // Вариант №15
    echo ('<br>' . 'Вариант №15' . '<br>');
    $a = rand(-20, 20); 
    $c = rand(-20, 20);
    $d = rand(-20, 20);
    echo ('Дано:' . '<br>' . 'a = ' . $a. '<br>' . 'c = '. $c . '<br>' . 'd = ' . $d . '<br>');
    $result = (12 / $c + 73 - pow($d, 2))/(pow($a, 2) - 2 * $a);
    echo ('Результат:' . '<br>' . $result. '<br>');
?>